; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-92)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b2)
    (on b2 b11)
    (on b11 b9)
    (on-table b9)
    (clear b12)
    (on b12 b19)
    (on b19 b16)
    (on b16 b7)
    (on b7 b1)
    (on b1 b27)
    (on-table b27)
    (clear b17)
    (on b17 b20)
    (on b20 b15)
    (on b15 b13)
    (on b13 b5)
    (on b5 b26)
    (on b26 b8)
    (on b8 b21)
    (on b21 b3)
    (on b3 b4)
    (on b4 b14)
    (on b14 b25)
    (on-table b25)
    (clear b22)
    (on b22 b18)
    (on b18 b24)
    (on b24 b6)
    (on b6 b10)
    (on-table b10))
 (:goal (and 
(on b10 b1)
))
)

; plan
1. (unstack b22 b18)
   deleted: (on b22 b18) (clear b22) (arm-empty)
   added: (holding b22) (clear b18)
   goals met: 0 of 1
2. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 0 of 1
3. (unstack b18 b24)
   deleted: (on b18 b24) (clear b18) (arm-empty)
   added: (holding b18) (clear b24)
   goals met: 0 of 1
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
5. (unstack b24 b6)
   deleted: (on b24 b6) (clear b24) (arm-empty)
   added: (holding b24) (clear b6)
   goals met: 0 of 1
6. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 0 of 1
7. (unstack b12 b19)
   deleted: (on b12 b19) (clear b12) (arm-empty)
   added: (holding b12) (clear b19)
   goals met: 0 of 1
8. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 0 of 1
9. (unstack b19 b16)
   deleted: (on b19 b16) (clear b19) (arm-empty)
   added: (holding b19) (clear b16)
   goals met: 0 of 1
10. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 0 of 1
11. (unstack b6 b10)
   deleted: (on b6 b10) (clear b6) (arm-empty)
   added: (holding b6) (clear b10)
   goals met: 0 of 1
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 0 of 1
13. (unstack b16 b7)
   deleted: (on b16 b7) (clear b16) (arm-empty)
   added: (holding b16) (clear b7)
   goals met: 0 of 1
14. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 0 of 1
15. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 0 of 1
16. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
17. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 0 of 1
18. (stack b10 b1)
   deleted: (clear b1) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b1)
   goals met: 1 of 1
